function [y] = getK(x, a, bits)
% вычисляет вероятность стойкости шифра
% a - вероятность успешного вскрытия шифра
% (1.0-a) - вероятность стойкого шифра

ek = (x-1980)/1.5-bits+56;
k = power(2, ek);

% k = 2^-x/3
% lnk=-x/3*ln2
% x = -lnk/ln2*3

% k = 1.0-(1.0-a)/(2^-x/3)
% k-1.0 = (1.0-a)/(2^-x/3)
% (2^-x/3) = (1.0-a)/(k-1.0)
% -x/3*ln2 = ln (1.0-a)/(k-1.0)
% x/3 = ln (1.0-a)/(k-1.0)  / ln2
k0 = 0.5;

k2 = 1.0-(1.0-a)*k;

y = k2;
        % -log(k0)/log(2)  === 1
        %y = power(1/2, x/1.5+1/1*(1+log(a/(1.0-k0))/log(2)));
end
